
{
value: [
{
id: 195,
joke: "Chuck Norris wears a live rattlesnake as a condom.",
categories: [ ]
},
{
id: 156,
joke: "There is no such thing as global warming. Chuck Norris was cold, so he turned the sun up.",
categories: [ ]
},
{
id: 405,
joke: "One time, at band camp, Chuck Norris ate a percussionist.",
categories: [ ]
},
{
id: 497,
joke: "If Chuck Norris writes code with bugs, the bugs fix themselves.",
categories: [
"nerdy"
]
},
{
id: 129,
joke: "Chuck Norris keeps his friends close and his enemies closer. Close enough to drop them with one round house kick to the face.",
categories: [ ]
},
{
id: 158,
joke: "It's widely believed that Jesus was Chuck Norris' stunt double for crucifixion due to the fact that it is impossible for nails to pierce Chuck Norris' skin.",
categories: [ ]
},
{
id: 280,
joke: "When Chuck Norris works out on the Total Gym, the Total Gym feels like it's been raped.",
categories: [ ]
},
{
id: 258,
joke: "The phrase 'break a leg' was originally coined by Chuck Norris's co-stars in Walker, Texas Ranger as a good luck charm, indicating that a broken leg might be the worst extent of their injuries. This never proved to be the case.",
categories: [ ]
},
{
id: 132,
joke: "An anagram for Walker Texas Ranger is KARATE WRANGLER SEX. I don't know what that is, but it sounds AWESOME.",
categories: [ ]
},
{
id: 502,
joke: "Chuck Norris insists on strongly-typed programming languages.",
categories: [
"nerdy"
]
},
{
id: 52,
joke: "When Chuck Norris sends in his taxes, he sends blank forms and includes only a picture of himself, crouched and ready to attack. Chuck Norris has not had to pay taxes, ever.",
categories: [ ]
},
{
id: 477,
joke: "Chuck Norris can access private methods.",
categories: [
"nerdy"
]
},
{
id: 83,
joke: "While urinating, Chuck Norris is easily capable of welding titanium.",
categories: [ ]
},
{
id: 200,
joke: "On the set of Walker Texas Ranger Chuck Norris brought a dying lamb back to life by nuzzling it with his beard. As the onlookers gathered, the lamb sprang to life. Chuck Norris then roundhouse kicked it, killing it instantly. This was just to prove that the good Chuck givet",
categories: [ ]
},
{
id: 159,
joke: "Chuck Norris did in fact, build Rome in a day.",
categories: [ ]
},
{
id: 361,
joke: "Who let the dogs out? Chuck Norris let the dogs out... and then roundhouse kicked them through an Oldsmobile.",
categories: [ ]
},
{
id: 426,
joke: "A man once taunted Chuck Norris with a bag of Lay's potato chips, saying &quot;Betcha can't eat just one!&quot; Chuck Norris proceeded to eat the chips, the bag, and the man in one deft move.",
categories: [ ]
},
{
id: 564,
joke: "Chuck Norris can download emails with his pick-up.",
categories: [
"nerdy"
]
},
{
id: 489,
joke: "Chuck Norris can write multi-threaded applications with a single thread.",
categories: [
"nerdy"
]
},
{
id: 167,
joke: "As a teen, Chuck Norris had sex with every nun in a convent tucked away in the hills of Tuscany. Nine months later the nuns gave birth to the 1972 Miami Dolphins, the only undefeated and untied team in professional football history.",
categories: [ ]
},
{
id: 124,
joke: "Chuck Norris once worked as a weatherman for the San Diego evening news. Every night he would make the same forecast: Partly cloudy with a 75% chance of Pain.",
categories: [ ]
},
{
id: 362,
joke: "Chuck Norris can do a roundhouse kick faster than the speed of light. This means that if you turn on a light switch, you will be dead before the lightbulb turns on.",
categories: [ ]
},
{
id: 601,
joke: "Chuck Norris can remember the future.",
categories: [ ]
},
{
id: 359,
joke: "Chuck Norris is his own line at the DMV.",
categories: [ ]
},
{
id: 561,
joke: "Chuck Norris doesn't need an account. He just logs in.",
categories: [ ]
},
{
id: 149,
joke: "Chuck Norris proved that we are alone in the universe. We weren't before his first space expedition.",
categories: [ ]
},
{
id: 334,
joke: "Chuck Norris qualified with a top speed of 324 mph at the Daytona 500, without a car.",
categories: [ ]
},
{
id: 233,
joke: "When Bruce Banner gets mad, he turns into the Hulk. When the Hulk gets mad, he turns into Chuck Norris.",
categories: [ ]
},
{
id: 404,
joke: "When Chuck Norris was born, he immediately had sex with the first nurse he saw. He was her first. She was his third. That afternoon.",
categories: [ ]
},
{
id: 40,
joke: "A handicapped parking sign does not signify that this spot is for handicapped people. It is actually in fact a warning, that the spot belongs to Chuck Norris and that you will be handicapped if you park there.",
categories: [ ]
},
{
id: 275,
joke: "Little Miss Muffet sat on her tuffet, until Chuck Norris roundhouse kicked her into a glacier.",
categories: [ ]
},
{
id: 598,
joke: "Once Chuck Norris and Superman had a competition. The loser had to wear his underwear over his pants.",
categories: [ ]
},
{
id: 431,
joke: "Rules of fighting: 1) Don't bring a knife to a gun fight. 2) Don't bring a gun to a Chuck Norris fight.",
categories: [ ]
},
{
id: 225,
joke: "Chuck Norris is the reason why Waldo is hiding.",
categories: [ ]
},
{
id: 287,
joke: "Chuck Norris' testicles do not produce sperm. They produce tiny white ninjas that recognize only one mission: seek and destroy.",
categories: [ ]
},
{
id: 36,
joke: "Chuck Norris originally appeared in the &quot;Street Fighter II&quot; video game, but was removed by Beta Testers because every button caused him to do a roundhouse kick. When asked about this glitch, Norris replied &quot;That's no glitch.&quot;",
categories: [
"nerdy"
]
},
{
id: 55,
joke: "Most people have 23 pairs of chromosomes. Chuck Norris has 72... and they're all poisonous.",
categories: [ ]
},
{
id: 222,
joke: "Industrial logging isn't the cause of deforestation. Chuck Norris needs toothpicks.",
categories: [ ]
},
{
id: 350,
joke: "Chuck Norris starts everyday with a protein shake made from Carnation Instant Breakfast, one dozen eggs, pure Colombian cocaine, and rattlesnake venom. He injects it directly into his neck with a syringe.",
categories: [ ]
},
{
id: 337,
joke: "The chemical formula for the highly toxic cyanide ion is CN-. These are also Chuck Norris' initials. This is not a coincidence.",
categories: [ ]
},
{
id: 144,
joke: "If, by some incredible space-time paradox, Chuck Norris would ever fight himself, he'd win. Period.",
categories: [ ]
},
{
id: 102,
joke: "Chuck Norris ordered a Big Mac at Burger King, and got one.",
categories: [ ]
},
{
id: 313,
joke: "All roads lead to Chuck Norris. And by the transitive property, a roundhouse kick to the face.",
categories: [ ]
},
{
id: 329,
joke: "There are only two things that can cut diamonds: other diamonds, and Chuck Norris.",
categories: [ ]
},
{
id: 150,
joke: "Superman once watched an episode of Walker, Texas Ranger. He then cried himself to sleep.",
categories: [ ]
},
{
id: 385,
joke: "Chuck Norris once rode a bull, and nine months later it had a calf.",
categories: [ ]
},
{
id: 147,
joke: "Science Fact: Roundhouse kicks are comprised primarily of an element called Chucktanium.",
categories: [ ]
},
{
id: 1,
joke: "Chuck Norris uses ribbed condoms inside out, so he gets the pleasure.",
categories: [
"explicit"
]
},
{
id: 197,
joke: "Chuck Norris began selling the Total Gym as an ill-fated attempt to make his day-to-day opponents less laughably pathetic.",
categories: [ ]
},
{
id: 506,
joke: "Chuck Norris programs do not accept input.",
categories: [
"nerdy"
]
},
{
id: 485,
joke: "Chuck Norris' Internet connection is faster upstream than downstream because even data has more incentive to run from him than to him.",
categories: [
"nerdy"
]
},
{
id: 45,
joke: "What was going through the minds of all of Chuck Norris' victims before they died? His shoe.",
categories: [ ]
},
{
id: 255,
joke: "Chuck Norris does not have to answer the phone. His beard picks up the incoming electrical impulses and translates them into audible sound.",
categories: [ ]
},
{
id: 4,
joke: "If you ask Chuck Norris what time it is, he always answers &quot;Two seconds till&quot;. After you ask &quot;Two seconds to what?&quot;, he roundhouse kicks you in the face.",
categories: [ ]
},
{
id: 125,
joke: "Simply by pulling on both ends, Chuck Norris can stretch diamonds back into coal.",
categories: [ ]
},
{
id: 123,
joke: "Some people wear Superman pajamas. Superman wears Chuck Norris pajamas.",
categories: [ ]
},
{
id: 398,
joke: "Chuck Norris is not Irish. His hair is soaked in the blood of his victims.",
categories: [ ]
},
{
id: 470,
joke: "Chuck Norris doesn't bug hunt as that signifies a probability of failure, he goes bug killing.",
categories: [
"nerdy"
]
},
{
id: 549,
joke: "Chuck Norris killed two stones with one bird.",
categories: [ ]
},
{
id: 15,
joke: "When Chuck Norris goes to donate blood, he declines the syringe, and instead requests a hand gun and a bucket.",
categories: [ ]
},
{
id: 12,
joke: "Chuck Norris sheds his skin twice a year.",
categories: [ ]
},
{
id: 130,
joke: "There is in fact an 'I' in Norris, but there is no 'team'. Not even close.",
categories: [ ]
},
{
id: 400,
joke: "Chuck Norris' dick is so big, it has it's own dick, and that dick is still bigger than yours.",
categories: [
"explicit"
]
},
{
id: 286,
joke: "The square root of Chuck Norris is pain. Do not try to square Chuck Norris, the result is death.",
categories: [ ]
},
{
id: 336,
joke: "Chuck Norris uses tabasco sauce instead of visine.",
categories: [ ]
},
{
id: 283,
joke: "The only sure things are Death and Taxes and when Chuck Norris goes to work for the IRS, they'll be the same thing.",
categories: [ ]
},
{
id: 566,
joke: "Chuck Norris could use anything in java.util.* to kill you, including the javadocs.",
categories: [
"nerdy"
]
},
{
id: 128,
joke: "A high tide means Chuck Norris is flying over your coast. The tide is caused by God pissing his pants.",
categories: [ ]
},
{
id: 266,
joke: "Chuck Norris? roundhouse kick is so powerful, it can be seen from outer space by the naked eye.",
categories: [ ]
},
{
id: 326,
joke: "As an infant, Chuck Norris' parents gave him a toy hammer. He gave the world Stonehenge.",
categories: [ ]
},
{
id: 170,
joke: "Wo hu cang long. The translation from Mandarin Chinese reads: &quot;Crouching Chuck, Hidden Norris&quot;",
categories: [ ]
},
{
id: 273,
joke: "Chuck Norris does not kick ass and take names. In fact, Chuck Norris kicks ass and assigns the corpse a number. It is currently recorded to be in the billions.",
categories: [ ]
},
{
id: 291,
joke: "Chuck Norris never wet his bed as a child. The bed wet itself out of fear.",
categories: [ ]
},
{
id: 392,
joke: "After returning from World War 2 unscrathed, Bob Dole was congratulated by Chuck Norris with a handshake. The rest is history.",
categories: [ ]
},
{
id: 323,
joke: "Chuck Norris can be unlocked on the hardest level of Tekken. But only Chuck Norris is skilled enough to unlock himself. Then he roundhouse kicks the Playstation back to Japan.",
categories: [ ]
},
{
id: 126,
joke: "When Chuck Norris does a pushup, he isn't lifting himself up, he's pushing the Earth down.",
categories: [ ]
},
{
id: 332,
joke: "What many people dont know is Chuck Norris is the founder of planned parenthood. Not even unborn children can escape his wrath.",
categories: [ ]
},
{
id: 565,
joke: "Chuck Norris can make a class that is both abstract and final.",
categories: [
"nerdy"
]
},
{
id: 320,
joke: "The First rule of Chuck Norris is: you do not talk about Chuck Norris.",
categories: [ ]
},
{
id: 529,
joke: "Chuck Norris doesn't use Oracle, he is the Oracle.",
categories: [
"nerdy"
]
},
{
id: 178,
joke: "In an act of great philanthropy, Chuck made a generous donation to the American Cancer Society. He donated 6,000 dead bodies for scientific research.",
categories: [ ]
},
{
id: 472,
joke: "When Chuck Norris is web surfing websites get the message &quot;Warning: Internet Explorer has deemed this user to be malicious or dangerous. Proceed?&quot;.",
categories: [
"nerdy"
]
},
{
id: 90,
joke: "Chuck Norris always knows the EXACT location of Carmen SanDiego.",
categories: [ ]
},
{
id: 325,
joke: "Every time someone uses the word &quot;intense&quot;, Chuck Norris always replies &quot;you know what else is intense?&quot; followed by a roundhouse kick to the face.",
categories: [ ]
},
{
id: 556,
joke: "Chuck Norris can write to an output stream.",
categories: [
"nerdy"
]
},
{
id: 26,
joke: "Chuck Norris is the only human being to display the Heisenberg uncertainty principle - you can never know both exactly where and how quickly he will roundhouse-kick you in the face.",
categories: [
"nerdy"
]
},
{
id: 188,
joke: "MacGyver can build an airplane out of gum and paper clips, but Chuck Norris can roundhouse-kick his head through a wall and take it.",
categories: [ ]
},
{
id: 18,
joke: "According to the Encyclopedia Brittanica, the Native American &quot;Trail of Tears&quot; has been redefined as anywhere that Chuck Norris walks.",
categories: [ ]
},
{
id: 162,
joke: "Once you go Norris, you are physically unable to go back.",
categories: [ ]
},
{
id: 47,
joke: "There is no theory of evolution, just a list of creatures Chuck Norris allows to live.",
categories: [ ]
},
{
id: 312,
joke: "Jesus can walk on water, but Chuck Norris can walk on Jesus.",
categories: [ ]
},
{
id: 182,
joke: "In a recent survey it was discovered the 94% of American women lost their virginity to Chuck Norris. The other 6% were incredibly fat or ugly.",
categories: [ ]
},
{
id: 509,
joke: "Chuck Norris's OSI network model has only one layer - Physical.",
categories: [
"nerdy"
]
},
{
id: 299,
joke: "Jack Bauer tried to use his detailed knowledge of torture techniques, but to no avail: Chuck Norris thrives on pain. Chuck Norris then ripped off Jack Bauer's arm and beat him to death with it. Game, set, match.",
categories: [ ]
},
{
id: 256,
joke: "How many roundhouse kicks does it take to get to the center of a tootsie pop? Just one. From Chuck Norris.",
categories: [ ]
},
{
id: 240,
joke: "In a fight between Batman and Darth Vader, the winner would be Chuck Norris.",
categories: [ ]
},
{
id: 510,
joke: "Chuck Norris can compile syntax errors.",
categories: [
"nerdy"
]
},
{
id: 423,
joke: "Chuck Norris had to stop washing his clothes in the ocean. The tsunamis were killing people.",
categories: [ ]
},
{
id: 117,
joke: "James Cameron wanted Chuck Norris to play the Terminator. However, upon reflection, he realized that would have turned his movie into a documentary, so he went with Arnold Schwarzenegger.",
categories: [ ]
},
{
id: 492,
joke: "There is no Esc key on Chuck Norris' keyboard, because no one escapes Chuck Norris.",
categories: [
"nerdy"
]
}
]
}
