{ "values": [ { "id": 487, "joke": "No statement can catch the ChuckNorrisException.", "categories": ["nerdy"] }, { "id": 192, "joke": "There is endless debate about the existence of the human soul. Well it does exist and Chuck Norris finds it delicious.", "categories": [] }, { "id": 240, "joke": "In a fight between Batman and Darth Vader, the winner would be Chuck Norris.", "categories": [] }, { "id": 125, "joke": "Simply by pulling on both ends, Chuck Norris can stretch diamonds back into coal.", "categories": [] }, { "id": 459, "joke": "Chuck Norris can solve the Towers of Hanoi in one move.", "categories": ["nerdy"] }, { "id": 124, "joke": "Chuck Norris once worked as a weatherman for the San Diego evening news. Every night he would make the same forecast: Partly cloudy with a 75% chance of Pain.", "categories": [] }, { "id": 532, "joke": "A diff between your code and Chuck Norris's is infinite.", "categories": ["nerdy"] }, { "id": 187, "joke": "# Chuck Norris's show is called Walker: Texas Ranger, because Chuck Norris doesn't run.", "categories": [] }, { "id": 258, "joke": "The phrase 'break a leg' was originally coined by Chuck Norris's co-stars in Walker, Texas Ranger as a good luck charm, indicating that a broken leg might be the worst extent of their injuries. This never proved to be the case.", "categories": [] }, { "id": 163, "joke": "Ninjas want to grow up to be just like Chuck Norris. But usually they grow up just to be killed by Chuck Norris.", "categories": [] }, { "id": 372, "joke": "Chuck Norris once rode a nine foot grizzly bear through an automatic car wash, instead of taking a shower.", "categories": [] }, { "id": 567, "joke": "Code runs faster when Chuck Norris watches it.", "categories": ["nerdy"] }, { "id": 531, "joke": "Jesus can walk on water, but Chuck Norris can swim through land.", "categories": [] }, { "id": 140, "joke": "Chuck Norris built a better mousetrap, but the world was too frightened to beat a path to his door.", "categories": [] }, { "id": 553, "joke": "China lets Chuck Norris search for porn on Google.", "categories": ["explicit"] }, { "id": 180, "joke": "When J. Robert Oppenheimer said &quot;I am become death, the destroyer Of worlds&quot;, He was not referring to the atomic bomb. He was referring to the Chuck Norris halloween costume he was wearing.", "categories": [] }, { "id": 389, "joke": "Chuck Norris has banned rainbows from the state of North Dakota.", "categories": [] }, { "id": 535, "joke": "Chuck Norris uses canvas in IE.", "categories": ["nerdy"] }, { "id": 135, "joke": "Chuck Norris roundhouse kicks don't really kill people. They wipe out their entire existence from the space-time continuum.", "categories": [] }, { "id": 40, "joke": "A handicapped parking sign does not signify that this spot is for handicapped people. It is actually in fact a warning, that the spot belongs to Chuck Norris and that you will be handicapped if you park there.", "categories": [] }, { "id": 343, "joke": "Chuck Norris doesn't chew gum. Chuck Norris chews tin foil.", "categories": [] }, { "id": 179, "joke": "Chuck Norris? favourite cut of meat is the roundhouse.", "categories": [] }, { "id": 263, "joke": "The original title for Star Wars was &quot;Skywalker: Texas Ranger&quot;. Starring Chuck Norris.", "categories": [] }, { "id": 398, "joke": "Chuck Norris is not Irish. His hair is soaked in the blood of his victims.", "categories": [] }, { "id": 523, "joke": "Chuck Norris can win in a game of Russian roulette with a fully loaded gun.", "categories": [] }, { "id": 78, "joke": "The grass is always greener on the other side, unless Chuck Norris has been there. In that case the grass is most likely soaked in blood and tears.", "categories": [] }, { "id": 222, "joke": "Industrial logging isn't the cause of deforestation. Chuck Norris needs toothpicks.", "categories": [] }, { "id": 503, "joke": "Chuck Norris protocol design method has no status, requests or responses, only commands.", "categories": ["nerdy"] }, { "id": 411, "joke": "The pen is mightier than the sword, but only if the pen is held by Chuck Norris.", "categories": [] }, { "id": 481, "joke": "For Chuck Norris, NP-Hard = O(1).", "categories": ["nerdy"] }, { "id": 65, "joke": "When Chuck Norris was denied an Egg McMuffin at McDonald's because it was 10:35, he roundhouse kicked the store so hard it became a Wendy's.", "categories": [] }, { "id": 12, "joke": "Chuck Norris sheds his skin twice a year.", "categories": [] }, { "id": 280, "joke": "When Chuck Norris works out on the Total Gym, the Total Gym feels like it's been raped.", "categories": [] }, { "id": 181, "joke": "Chuck Norris recently had the idea to sell his urine as a canned beverage. We know this beverage as Red Bull.", "categories": [] }, { "id": 131, "joke": "Scotty in Star Trek often says &quot;Ye cannae change the laws of physics.&quot; This is untrue. Chuck Norris can change the laws of physics. With his fists.", "categories": [] }, { "id": 13, "joke": "Chuck Norris once challenged Lance Armstrong in a &quot;Who has more testicles?&quot; contest. Chuck Norris won by 5.", "categories": ["explicit"] }, { "id": 60, "joke": "When Chuck Norris calls 1-900 numbers, he doesn't get charged. He holds up the phone and money falls out.", "categories": [] }, { "id": 291, "joke": "Chuck Norris never wet his bed as a child. The bed wet itself out of fear.", "categories": [] }, { "id": 284, "joke": "Chuck Norris' first job was as a paperboy. There were no survivors.", "categories": [] }, { "id": 290, "joke": "There are two types of people in the world... people that suck, and Chuck Norris.", "categories": [] }, { "id": 51, "joke": "The quickest way to a man's heart is with Chuck Norris' fist.", "categories": [] }, { "id": 37, "joke": "If you spell Chuck Norris in Scrabble, you win. Forever.", "categories": [] }, { "id": 38, "joke": "Someone once videotaped Chuck Norris getting pissed off. It was called Walker: Texas Chain Saw Masacre.", "categories": [] }, { "id": 213, "joke": "How many Chuck Norris' does it take to change a light bulb? None, Chuck Norris prefers to kill in the dark.", "categories": [] }, { "id": 257, "joke": "Chuck Norris doesnt wear a watch, HE decides what time it is.", "categories": [] }, { "id": 472, "joke": "When Chuck Norris is web surfing websites get the message &quot;Warning: Internet Explorer has deemed this user to be malicious or dangerous. Proceed?&quot;.", "categories": ["nerdy"] }, { "id": 310, "joke": "182,000 Americans die from Chuck Norris-related accidents every year.", "categories": [] }, { "id": 309, "joke": "Chuck Norris can win a game of Trivial Pursuit with one roll of the dice, and without answering a single question... just a nod of the head, and a stroke of the beard.", "categories": [] }, { "id": 111, "joke": "Chuck Norris has a deep and abiding respect for human life... unless it gets in his way.", "categories": [] }, { "id": 98, "joke": "In the beginning there was nothing...then Chuck Norris Roundhouse kicked that nothing in the face and said &quot;Get a job&quot;. That is the story of the universe.", "categories": [] }, { "id": 490, "joke": "Chuck Norris doesn't need to use AJAX because pages are too afraid to postback anyways.", "categories": ["nerdy"] }, { "id": 591, "joke": "There is no April 1st in Chuck Norris' calendar, because no one can fool him.", "categories": [] }, { "id": 149, "joke": "Chuck Norris proved that we are alone in the universe. We weren't before his first space expedition.", "categories": [] }, { "id": 325, "joke": "Every time someone uses the word &quot;intense&quot;, Chuck Norris always replies &quot;you know what else is intense?&quot; followed by a roundhouse kick to the face.", "categories": [] }, { "id": 287, "joke": "Chuck Norris' testicles do not produce sperm. They produce tiny white ninjas that recognize only one mission: seek and destroy.", "categories": [] }, { "id": 42, "joke": "Chuck Norris doesn't churn butter. He roundhouse kicks the cows and the butter comes straight out.", "categories": [] }, { "id": 489, "joke": "Chuck Norris can write multi-threaded applications with a single thread.", "categories": ["nerdy"] }, { "id": 431, "joke": "Rules of fighting: 1) Don't bring a knife to a gun fight. 2) Don't bring a gun to a Chuck Norris fight.", "categories": [] }, { "id": 84, "joke": "When Chuck Norris talks, everybody listens. And dies.", "categories": [] }, { "id": 413, "joke": "Those aren't credits that roll after Walker Texas Ranger. It is actually a list of fatalities that occurred during the making of the episode.", "categories": [] }, { "id": 190, "joke": "Chuck Norris brushes his teeth with a mixture of iron shavings, industrial paint remover, and wood-grain alcohol.", "categories": [] }, { "id": 87, "joke": "Contrary to popular belief, there is indeed enough Chuck Norris to go around.", "categories": [] }, { "id": 454, "joke": "Chuck Norris's first program was kill -9.", "categories": ["nerdy"] }, { "id": 511, "joke": "Every SQL statement that Chuck Norris codes has an implicit &quot;COMMIT&quot; in its end.", "categories": ["nerdy"] }, { "id": 296, "joke": "Chuck Norris uses 8'x10' sheets of plywood as toilet paper.", "categories": [] }, { "id": 62, "joke": "Some people like to eat frogs' legs. Chuck Norris likes to eat lizard legs. Hence, snakes.", "categories": [] }, { "id": 43, "joke": "Police label anyone attacking Chuck Norris as a Code 45-11.... A suicide.", "categories": [] }, { "id": 307, "joke": "Chuck Norris never has to wax his skis because they're always slick with blood.", "categories": [] }, { "id": 563, "joke": "Chuck Norris causes the Windows Blue Screen of Death.", "categories": ["nerdy"] }, { "id": 394, "joke": "&quot;Let the Bodies Hit the Floor&quot; was originally written as Chuck Norris' theme song.", "categories": [] }, { "id": 227, "joke": "When God said, &quot;let there be light&quot;, Chuck Norris said, &quot;say 'please'.&quot;", "categories": [] }, { "id": 120, "joke": "Chuck Norris played Russian Roulette with a fully loaded gun and won.", "categories": [] }, { "id": 349, "joke": "A man once asked Chuck Norris if his real name is &quot;Charles&quot;. Chuck Norris did not respond, he simply stared at him until he exploded.", "categories": [] }, { "id": 420, "joke": "The 1972 Miami Dolphins lost one game, it was a game vs. Chuck Norris and three seven year old girls. Chuck Norris won with a roundhouse-kick to the face in overtime.", "categories": [] }, { "id": 480, "joke": "The class object inherits from Chuck Norris", "categories": ["nerdy"] }, { "id": 526, "joke": "No one has ever pair-programmed with Chuck Norris and lived to tell about it.", "categories": ["nerdy"] }, { "id": 178, "joke": "In an act of great philanthropy, Chuck made a generous donation to the American Cancer Society. He donated 6,000 dead bodies for scientific research.", "categories": [] }, { "id": 324, "joke": "Chuck Norris drinks napalm to quell his heartburn.", "categories": [] }, { "id": 561, "joke": "Chuck Norris doesn't need an account. He just logs in.", "categories": [] }, { "id": 502, "joke": "Chuck Norris insists on strongly-typed programming languages.", "categories": ["nerdy"] }, { "id": 217, "joke": "Crime does not pay - unless you are an undertaker following Walker, Texas Ranger, on a routine patrol.", "categories": [] }, { "id": 319, "joke": "In the Words of Julius Caesar, &quot;Veni, Vidi, Vici, Chuck Norris&quot;. Translation: I came, I saw, and I was roundhouse-kicked inthe face by Chuck Norris.", "categories": [] }, { "id": 14, "joke": "There are no steroids in baseball. Just players Chuck Norris has breathed on.", "categories": [] }, { "id": 599, "joke": "Chuck Norris can make fire using two ice cubes.", "categories": [] }, { "id": 272, "joke": "Chuck Norris can taste lies.", "categories": [] }, { "id": 64, "joke": "There are no races, only countries of people Chuck Norris has beaten to different shades of black and blue.", "categories": [] }, { "id": 488, "joke": "Chuck Norris doesn't pair program.", "categories": ["nerdy"] }, { "id": 16, "joke": "Pluto is actually an orbiting group of British soldiers from the American Revolution who entered space after the Chuck gave them a roundhouse kick to the face.", "categories": [] }, { "id": 400, "joke": "Chuck Norris' dick is so big, it has it's own dick, and that dick is still bigger than yours.", "categories": ["explicit"] }, { "id": 82, "joke": "When an episode of Walker Texas Ranger was aired in France, the French surrendered to Chuck Norris just to be on the safe side.", "categories": [] }, { "id": 342, "joke": "Chuck Norris owns a chain of fast-food restaurants throughout the southwest. They serve nothing but barbecue-flavored ice cream and Hot Pockets.", "categories": [] }, { "id": 507, "joke": "Chuck Norris can install iTunes without installing Quicktime.", "categories": ["nerdy"] }, { "id": 393, "joke": "Chuck Norris runs on batteries. Specifically, Die Hards.", "categories": [] }, { "id": 354, "joke": "For undercover police work, Chuck Norris pins his badge underneath his shirt, directly into his chest.", "categories": [] }, { "id": 249, "joke": "Maslow's theory of higher needs does not apply to Chuck Norris. He only has two needs: killing people and finding people to kill.", "categories": [] }, { "id": 537, "joke": "Each hair in Chuck Norris's beard contributes to make the world's largest DDOS.", "categories": ["nerdy"] }, { "id": 195, "joke": "Chuck Norris wears a live rattlesnake as a condom.", "categories": [] }, { "id": 83, "joke": "While urinating, Chuck Norris is easily capable of welding titanium.", "categories": [] }, { "id": 533, "joke": "The Chuck Norris Eclipse plugin made alien contact.", "categories": ["nerdy"] }, { "id": 225, "joke": "Chuck Norris is the reason why Waldo is hiding.", "categories": [] } ]  }
